app/controllers/users/multi_factor_authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def user
    return @user if @user.present?
    # @qr = RQRCode::QRCode.new(resource.provisioning_uri, size: 5, level: :h )
    @user = User.find(params[:id])